In [14]:
import pandas as pd

df = pd.read_csv('./titanic_data.csv')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           1309 non-null   int64
 1   'pclass'     1309 non-null   int64
 2   'survived'   1309 non-null   int64
 3   'Name'       1309 non-null   object
 4   'Sex'        1309 non-null   object
 5   'Age'        1309 non-null   object
 6   'Sibsp'      1309 non-null   int64
 7   'Parch'      1309 non-null   int64
 8   'Ticket'     1309 non-null   object
 9   'fare'       1309 non-null   object
 10  'CABIN'      1309 non-null   object
 11  'Embarked'   1309 non-null   object
 12  'boat'       1309 non-null   object
 13  'body'       1309 non-null   object
 14  'home.dest'  1309 non-null   object
dtypes: int64(5), object(10)
memory usage: 153.5+ KB

In [15]:
df = df.rename({i:i.replace("'","").lower() for i in df.columns.to_list()}, axis = 1) \
    .drop(columns = ['name', 'ticket','home.dest'])

df['age'] = pd.to_numeric(df['age'], errors='coerce')

df = df.assign(age = lambda x: x.age.fillna(x.age.mean()).astype('int'))

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        1309 non-null   int64
 1   pclass    1309 non-null   int64
 2   survived  1309 non-null   int64
 3   sex       1309 non-null   object
 4   age       1309 non-null   int32
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   fare      1309 non-null   object
 8   cabin     1309 non-null   object
 9   embarked  1309 non-null   object
 10  boat      1309 non-null   object
 11  body      1309 non-null   object
dtypes: int32(1), int64(5), object(6)
memory usage: 117.7+ KB

In [4]:
df['age'].astype(float,errors='ignore')

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

In [5]:
df[df['id'] == 1306]

,id,pclass,survived,sex,age,sibsp,parch,fare,cabin,embarked,boat,body
1305,1306,3,0,female,?,1,0,14.4542,?,C,?,?

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        1309 non-null   int64
 1   pclass    1309 non-null   int64
 2   survived  1309 non-null   int64
 3   sex       1309 non-null   object
 4   age       1309 non-null   object
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   fare      1309 non-null   object
 8   cabin     1309 non-null   object
 9   embarked  1309 non-null   object
 10  boat      1309 non-null   object
 11  body      1309 non-null   object
dtypes: int64(5), object(7)
memory usage: 122.8+ KB

In [7]:
df['age'] = pd.to_numeric(df['age'], errors='coerce')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        1309 non-null   int64
 1   pclass    1309 non-null   int64
 2   survived  1309 non-null   int64
 3   sex       1309 non-null   object
 4   age       1046 non-null   float64
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   fare      1309 non-null   object
 8   cabin     1309 non-null   object
 9   embarked  1309 non-null   object
 10  boat      1309 non-null   object
 11  body      1309 non-null   object
dtypes: float64(1), int64(5), object(6)
memory usage: 122.8+ KB

In [9]:
df[df['id'] == 1306]

,id,pclass,survived,sex,age,sibsp,parch,fare,cabin,embarked,boat,body
1305,1306,3,0,female,NaN,1,0,14.4542,?,C,?,?

In [12]:
df = df.assign(age = lambda x: x.age.fillna(x.age.mean()).astype('int'))

In [13]:
df[df['id'] == 1306]

,id,pclass,survived,sex,age,sibsp,parch,fare,cabin,embarked,boat,body
1305,1306,3,0,female,29,1,0,14.4542,?,C,?,?